/*************************************************
*  Copyright(c) 2018-2020 DaBanJia
*  All rights reserved.
*
*  文件名称:Box2D
*  简要描述:矩形盒子，默认Z不考虑
*
*  当前版本: V1.0.0
*  作者:jirenze
*  创建日期:2018-09-05
*  说明:工具
**************************************************/

#pragma once
#include "Point2f.h"

struct Box2D
{
	/************************************************************************
		*  ___________max
		* |     |     |
		* |     |     |
		* |-----c-----|
		* |     |     |
		* min___|_____|
		*
		************************************************************************/
public:

	Box2D() {};

	Box2D(const Point2f &min, const Point2f &max)
		:min_point(min), max_point(max)
	{
	}

	bool operator==(const Box2D &other) const;

	Box2D operator=(const Box2D &other);

	/*****************************************************************
	 * 功能描述:得到盒子的范围.
	 *
	 * @return 盒子的范围.
	 *****************************************************************/
	Point2f GetExtent() const;

	/*****************************************************************
	 * 功能描述:得到盒子的中心点.
	 *
	 * @return 盒子的中心点.
	 *****************************************************************/
	Point2f GetCenter() const;

	/*****************************************************************
	 * 功能描述:得到盒子的尺寸.
	 *
	 * @return 盒子的size尺寸.
	 *****************************************************************/
	Point2f GetSize() const;

public:

	//x,y最小的点
	Point2f min_point;

	//x,y最大的点
	Point2f max_point;

};



